hermes-demo/hermes-demo.org
#+TITLE: Hermes Demo (10 min)
#+DATE: [2021-03-26 Fri]
#+OPTIONS: num:nil
#+SETUPFILE: ~/org/theme-readtheorg.setup

* Hermes Docker Container(s)

Most painless way to get started w/ Hermes:
[[https://hub.docker.com/repository/docker/hdfgroup/hermes][https://hub.docker.com/repository/docker/hdfgroup/hermes]]

Make sure you allow the container to use a generous amount of shared memory, and
mount all the volumes you'd like to find in the container.

#+begin_src sh

docker run -it --name hermes_container --shm-size 1G \
       -v /mnt/hd:/hd -v /mnt/sdcard:/sdcard \
       --entrypoint /bin/bash 5239038d60f1

#+end_src

* Demo 1 - Hermes Basics
** Goal

Demonstrate how to create a bucket and write (~Bucket::Put~) a sequence of blobs
of a given size using a specified placement strategy, and read (~Bucket::Get~)
them back.

** Outline

This is what a "native" Hermes app. looks like, currently.

#+begin_src C++ :noweb noexport

<<boilerplate>>

void hermes_app_main(int* argcp, char*** argvp,
                     std::shared_ptr<hapi::Hermes> const& hermes)
{
  <<hermes-main>>
}

int main(int argc, char **argv)
{
  <<cpp-main>>
}

#+end_src

** Boilerplate

#+begin_src C++ :noweb-ref boilerplate

#include "hermes.h"
#include "bucket.h"

#include <cassert>
#include <chrono>
#include <cstdint>
#include <iostream>
#include <thread>
#include <vector>

#include <mpi.h>

namespace hapi = hermes::api;

using namespace std::chrono;

#+end_src

