hermes-demo/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-26 Fri 09:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hermes Demo (10 min)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Gerd Heber" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Hermes Demo (10 min)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf1bdc8c">Hermes Docker Container(s)</a></li>
<li><a href="#orgae44a70">Demo 1 - Hermes Basics</a>
<ul>
<li><a href="#orgbc87a53">Goal</a></li>
<li><a href="#org1457706">Outline</a></li>
<li><a href="#org64a925a">Boilerplate</a></li>
<li><a href="#org07933af">Hermes <code>main</code></a></li>
<li><a href="#org0f03805">C++ <code>main</code></a></li>
<li><a href="#org0a14512">Do it</a></li>
<li><a href="#orgb4c5984">Sample results</a></li>
</ul>
</li>
<li><a href="#orgd6dabb6">Demo 2 - The UNIX STDIO Adapter</a>
<ul>
<li><a href="#org5075c1c">Goal</a></li>
<li><a href="#org8b5abbe">Code</a></li>
<li><a href="#org2a733df">Sample results</a></li>
</ul>
</li>
<li><a href="#org646ec82">Appendix</a>
<ul>
<li><a href="#orgd70f72d"><code>hermes.conf</code></a></li>
</ul>
</li>
<li><a href="#org80affc3"><code>demo1.cc</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf1bdc8c" class="outline-2">
<h2 id="orgf1bdc8c">Hermes Docker Container(s)</h2>
<div class="outline-text-2" id="text-orgf1bdc8c">
<p>
Most painless way to get started w/ Hermes:
<a href="https://hub.docker.com/repository/docker/hdfgroup/hermes">https://hub.docker.com/repository/docker/hdfgroup/hermes</a>
</p>

<p>
Make sure you allow the container to use a generous amount of shared memory, and
mount all the volumes you'd like to find in the container.
</p>

<div class="org-src-container">
<pre class="src src-sh">
docker run -it --name hermes_container --shm-size 1G <span style="color: #008000;">\</span>
       -v /mnt/hd:/hd -v /mnt/sdcard:/sdcard <span style="color: #008000;">\</span>
       --entrypoint /bin/bash 5239038d60f1

</pre>
</div>
</div>
</div>

<div id="outline-container-orgae44a70" class="outline-2">
<h2 id="orgae44a70">Demo 1 - Hermes Basics</h2>
<div class="outline-text-2" id="text-orgae44a70">
</div>
<div id="outline-container-orgbc87a53" class="outline-3">
<h3 id="orgbc87a53">Goal</h3>
<div class="outline-text-3" id="text-orgbc87a53">
<p>
Demonstrate how to create a bucket and write (<code>Bucket::Put</code>) a sequence of blobs
of a given size using a specified placement strategy, and read (<code>Bucket::Get</code>)
them back.
</p>
</div>
</div>

<div id="outline-container-org1457706" class="outline-3">
<h3 id="org1457706">Outline</h3>
<div class="outline-text-3" id="text-org1457706">
<p>
This is what a "native" Hermes app. looks like, currently.
</p>

<div class="org-src-container">
<pre class="src src-C++">
&lt;&lt;boilerplate&gt;&gt;

<span style="color: #6434A3;">void</span> hermes_app_main(<span style="color: #6434A3;">int</span>* <span style="color: #BA36A5;">argcp</span>, <span style="color: #6434A3;">char</span>*** <span style="color: #BA36A5;">argvp</span>,
                     <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">shared_ptr</span>&lt;<span style="color: #D0372D;">hapi</span>::Hermes&gt; <span style="color: #0000FF;">const</span>&amp; <span style="color: #BA36A5;">hermes</span>)
{
  &lt;&lt;hermes-main&gt;&gt;
}

<span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">argc</span>, <span style="color: #6434A3;">char</span> **<span style="color: #BA36A5;">argv</span>)
{
  &lt;&lt;cpp-main&gt;&gt;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org64a925a" class="outline-3">
<h3 id="org64a925a">Boilerplate</h3>
<div class="outline-text-3" id="text-org64a925a">
<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #808080;">#include</span> <span style="color: #008000;">"hermes.h"</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">"bucket.h"</span>

<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;cassert&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;chrono&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;cstdint&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;iostream&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;thread&gt;</span>
<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;vector&gt;</span>

<span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;mpi.h&gt;</span>

<span style="color: #0000FF;">namespace</span> <span style="color: #D0372D;">hapi</span> = <span style="color: #D0372D;">hermes</span>::api;

<span style="color: #0000FF;">using</span> <span style="color: #0000FF;">namespace</span> <span style="color: #D0372D;">std</span>::<span style="color: #D0372D;">chrono</span>;

</pre>
</div>
</div>
</div>
