hermes-demo/hermes-demo.org
** Hermes =main=

Parse arguments and get our "house number."

Remember, Hermes does *NOT* use MPI for communication!

#+begin_src C++ :noweb-ref hermes-main

  if (*argcp != 5)
    exit(-1);

  size_t count = (size_t) atol((*argvp)[1]);
  assert(count >= 1);
  size_t size_mib = (size_t) atol((*argvp)[2]);
  assert(size_mib >= 1);
  int strategy = atoi((*argvp)[3]);
  assert(strategy >= 0 && strategy < 3);

  int app_rank = hermes->GetProcessRank();
  int app_size = hermes->GetNumProcesses();

  size_t my_count = (count - count%app_size) / app_size;

 #+end_src

Create a context and pick a default data placement policy.

Create a shared bucket and a 1 MiB "dummy" blob that we'll place multiple times.

#+begin_src C++ :noweb-ref hermes-main

  hapi::Context ctx;

  switch (strategy)
    {
    case 0:
      ctx.policy = hapi::PlacementPolicy::kRandom;
      break;
    case 1:
      ctx.policy = hapi::PlacementPolicy::kRoundRobin;
      break;
    case 2:
      ctx.policy = hapi::PlacementPolicy::kMinimizeIoTime;
      break;
    default:
      break;
    }

  hapi::Bucket shared_bucket(std::string("Share the bucket!"), hermes, ctx);

  std::vector<uint8_t> MiB(size_mib*1024*1024);
  uint8_t* data = &MiB[0];

#+end_src

#+begin_src C++ :hidden :noweb-ref hermes-main

  auto sleep_duration = std::chrono::microseconds(150000);
  hermes->AppBarrier();
  auto start = high_resolution_clock::now();

  #+end_src

Do a bunch of ~Bucket::Put~ operations.

*Note:* There is a vectorized version of ~Bucket::Put~.

#+begin_src C++ :noweb-ref hermes-main

  for (size_t i = app_rank; i < count; i += app_size)
    {
      std::string blob_name = ".hermes/" + std::to_string(i);
      if (shared_bucket.Put(blob_name, data, MiB.size(), ctx).Failed())
        throw("What the Bucket::Put?");
      // HACK: Give the system a chance to update its view state!
      std::this_thread::sleep_for(sleep_duration);
    }

 #+end_src

#+begin_src C++ :dir hidden :noweb-ref hermes-main

  auto elapsed = high_resolution_clock::now() - start;
  uint64_t us = duration_cast<microseconds>(elapsed).count() -
    my_count * sleep_duration.count();
  std::cout << "Bucket->Put [us] : " << us << " : ~"
            << 1024 * 1024 * size_mib * my_count / us << " MB/s\n";

  hermes->AppBarrier();
  start = high_resolution_clock::now();

#+end_src

Do a bunch of ~Bucket::Get~ operations.

#+begin_src C++ :noweb-ref hermes-main

  for (size_t i = app_rank; i < count; i += app_size)
    {
      std::string blob_name = ".hermes/" + std::to_string(i);
      if (shared_bucket.Get(blob_name, MiB, ctx) != MiB.size())
        throw("What the Bucket::Get?");
    }

#+end_src

#+begin_src C++ :hidden :noweb-ref hermes-main

  hermes->AppBarrier();

  elapsed = high_resolution_clock::now() - start;
  us = duration_cast<microseconds>(elapsed).count();

  std::cout << "Bucket->Get [us] : " << us << " : ~"
            << 1024 * 1024 * size_mib * my_count / us << " MB/s\n";

  shared_bucket.Close(ctx);

#+end_src

** C++ =main=

Make sure we have the right capabilities. Remember that we do *NOT* use MPI for
communication. We just use the mechanics to spawn processes.

#+begin_src C++ :noweb-ref cpp-main

  try
    {
      int mpi_threads_provided;
      MPI_Init_thread(&argc, &argv, MPI_THREAD_MULTIPLE,
                      &mpi_threads_provided);
      if (mpi_threads_provided < MPI_THREAD_MULTIPLE)
        {
          std::cerr << "Didn't receive appropriate MPI threading spec.\n";
          return 1;
        }

      char *config_file = 0;
      if (argc == 5)
        config_file = argv[argc-1];
      else
        {
          std::cerr << "demo <blob_count> <blob_size_mib> "
                    << "<placement_strategy> <hermes_config> !\n";
          exit(-1);
        }

#+end_src

In Hermes, there are two kinds of processes, processes that execute application
code and processes that perform Hermes system functions.

We measure the time application processes spend in ~hermes->Finalize~, which is
essentially flushing buffers.

#+begin_src C++ :noweb-ref cpp-main

    std::shared_ptr<hapi::Hermes> hermes = hapi::InitHermes(config_file);

    if (hermes->IsApplicationCore())
      {
        hermes_app_main(&argc, &argv, hermes);

        int app_size = hermes->GetNumProcesses();
        auto start = high_resolution_clock::now();

        hermes->Finalize();

        auto elapsed = high_resolution_clock::now() - start;
        uint64_t us = duration_cast<microseconds>(elapsed).count();

        std::cout << "hermes->Finalize [us] : " << us << " : ~"
                  << (size_t) (atol(argv[1])*atol(argv[2])*1024*1024 /
                               (app_size * us)) << " MB/s\n";
      }
    else
      hermes->Finalize();

#+end_src

#+begin_src C++ :hidden :noweb-ref cpp-main

    MPI_Finalize();
  }
catch (const std::exception& e)
  {
    std::cout << " a standard exception was caught, with message '"
              << e.what() << "'\n";
  }

return 0;

#+end_src

