hermes-demo/index.html

<div id="outline-container-org07933af" class="outline-3">
<h3 id="org07933af">Hermes <code>main</code></h3>
<div class="outline-text-3" id="text-org07933af">
<p>
Parse arguments and get our "house number."
</p>

<p>
Remember, Hermes does <b>NOT</b> use MPI for communication!
</p>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #0000FF;">if</span> (*argcp != 5)
  exit(-1);

<span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">count</span> = (<span style="color: #6434A3;">size_t</span>) atol((*argvp)[1]);
assert(count &gt;= 1);
<span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">size_mib</span> = (<span style="color: #6434A3;">size_t</span>) atol((*argvp)[2]);
assert(size_mib &gt;= 1);
<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">strategy</span> = atoi((*argvp)[3]);
assert(strategy &gt;= 0 &amp;&amp; strategy &lt; 3);

<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">app_rank</span> = hermes-&gt;GetProcessRank();
<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">app_size</span> = hermes-&gt;GetNumProcesses();

<span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">my_count</span> = (count - count%app_size) / app_size;

</pre>
</div>

<p>
Create a context and pick a default data placement policy.
</p>

<p>
Create a shared bucket and a 1 MiB "dummy" blob that we'll place multiple times.
</p>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #D0372D;">hapi</span>::<span style="color: #6434A3;">Context</span> <span style="color: #BA36A5;">ctx</span>;

<span style="color: #0000FF;">switch</span> (strategy)
  {
  <span style="color: #0000FF;">case</span> 0:
    ctx.policy = <span style="color: #D0372D;">hapi</span>::<span style="color: #D0372D;">PlacementPolicy</span>::kRandom;
    <span style="color: #0000FF;">break</span>;
  <span style="color: #0000FF;">case</span> 1:
    ctx.policy = <span style="color: #D0372D;">hapi</span>::<span style="color: #D0372D;">PlacementPolicy</span>::kRoundRobin;
    <span style="color: #0000FF;">break</span>;
  <span style="color: #0000FF;">case</span> 2:
    ctx.policy = <span style="color: #D0372D;">hapi</span>::<span style="color: #D0372D;">PlacementPolicy</span>::kMinimizeIoTime;
    <span style="color: #0000FF;">break</span>;
  <span style="color: #0000FF;">default</span>:
    <span style="color: #0000FF;">break</span>;
  }

<span style="color: #D0372D;">hapi</span>::<span style="color: #6434A3;">Bucket</span> <span style="color: #006699;">shared_bucket</span>(<span style="color: #D0372D;">std</span>::string(<span style="color: #008000;">"Share the bucket!"</span>), hermes, ctx);

<span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">vector</span>&lt;<span style="color: #6434A3;">uint8_t</span>&gt; <span style="color: #006699;">MiB</span>(<span style="color: #6434A3;">size_mib</span>*1024*1024);
<span style="color: #6434A3;">uint8_t</span>* <span style="color: #BA36A5;">data</span> = &amp;MiB[0];

</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">sleep_duration</span> = <span style="color: #D0372D;">std</span>::<span style="color: #D0372D;">chrono</span>::microseconds(150000);
hermes-&gt;AppBarrier();
<span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">start</span> = <span style="color: #D0372D;">high_resolution_clock</span>::now();

</pre>
</div>

<p>
Do a bunch of <code>Bucket::Put</code> operations.
</p>

<p>
<b>Note:</b> There is a vectorized version of <code>Bucket::Put</code>.
</p>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #0000FF;">for</span> (<span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">i</span> = app_rank; i &lt; count; i += app_size)
  {
    <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">string</span> <span style="color: #BA36A5;">blob_name</span> = <span style="color: #008000;">".hermes/"</span> + <span style="color: #D0372D;">std</span>::to_string(i);
    <span style="color: #0000FF;">if</span> (shared_bucket.Put(blob_name, data, MiB.size(), ctx).Failed())
      <span style="color: #0000FF;">throw</span>(<span style="color: #008000;">"What the Bucket::Put?"</span>);
    <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">HACK: Give the system a chance to update its view state!</span>
    <span style="color: #D0372D;">std</span>::<span style="color: #D0372D;">this_thread</span>::sleep_for(sleep_duration);
  }

</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">elapsed</span> = <span style="color: #D0372D;">high_resolution_clock</span>::now() - start;
<span style="color: #6434A3;">uint64_t</span> <span style="color: #BA36A5;">us</span> = duration_cast&lt;microseconds&gt;(elapsed).count() -
  my_count * sleep_duration.count();
<span style="color: #D0372D;">std</span>::cout &lt;&lt; <span style="color: #008000;">"Bucket-&gt;Put [us] : "</span> &lt;&lt; us &lt;&lt; <span style="color: #008000;">" : ~"</span>
          &lt;&lt; 1024 * 1024 * size_mib * my_count / us &lt;&lt; <span style="color: #008000;">" MB/s\n"</span>;

hermes-&gt;AppBarrier();
start = <span style="color: #D0372D;">high_resolution_clock</span>::now();

</pre>
</div>

<p>
Do a bunch of <code>Bucket::Get</code> operations.
</p>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #0000FF;">for</span> (<span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">i</span> = app_rank; i &lt; count; i += app_size)
  {
    <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">string</span> <span style="color: #BA36A5;">blob_name</span> = <span style="color: #008000;">".hermes/"</span> + <span style="color: #D0372D;">std</span>::to_string(i);
    <span style="color: #0000FF;">if</span> (shared_bucket.Get(blob_name, MiB, ctx) != MiB.size())
      <span style="color: #0000FF;">throw</span>(<span style="color: #008000;">"What the Bucket::Get?"</span>);
  }

</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++">
hermes-&gt;AppBarrier();

elapsed = <span style="color: #D0372D;">high_resolution_clock</span>::now() - start;
us = duration_cast&lt;microseconds&gt;(elapsed).count();

<span style="color: #D0372D;">std</span>::cout &lt;&lt; <span style="color: #008000;">"Bucket-&gt;Get [us] : "</span> &lt;&lt; us &lt;&lt; <span style="color: #008000;">" : ~"</span>
          &lt;&lt; 1024 * 1024 * size_mib * my_count / us &lt;&lt; <span style="color: #008000;">" MB/s\n"</span>;

shared_bucket.Close(ctx);

</pre>
</div>
</div>
</div>

<div id="outline-container-org0f03805" class="outline-3">
<h3 id="org0f03805">C++ <code>main</code></h3>
<div class="outline-text-3" id="text-org0f03805">
<p>
Make sure we have the right capabilities. Remember that we do <b>NOT</b> use MPI for
communication. We just use the mechanics to spawn processes.
</p>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #0000FF;">try</span>
  {
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">mpi_threads_provided</span>;
    MPI_Init_thread(&amp;argc, &amp;argv, MPI_THREAD_MULTIPLE,
                    &amp;mpi_threads_provided);
    <span style="color: #0000FF;">if</span> (mpi_threads_provided &lt; MPI_THREAD_MULTIPLE)
      {
        <span style="color: #D0372D;">std</span>::cerr &lt;&lt; <span style="color: #008000;">"Didn't receive appropriate MPI threading spec.\n"</span>;
        <span style="color: #0000FF;">return</span> 1;
      }

    <span style="color: #6434A3;">char</span> *<span style="color: #BA36A5;">config_file</span> = 0;
    <span style="color: #0000FF;">if</span> (argc == 5)
      config_file = argv[argc-1];
    <span style="color: #0000FF;">else</span>
      {
        <span style="color: #D0372D;">std</span>::cerr &lt;&lt; <span style="color: #008000;">"demo &lt;blob_count&gt; &lt;blob_size_mib&gt; "</span>
                  &lt;&lt; <span style="color: #008000;">"&lt;placement_strategy&gt; &lt;hermes_config&gt; !\n"</span>;
        exit(-1);
      }

</pre>
</div>

<p>
In Hermes, there are two kinds of processes, processes that execute application
code and processes that perform Hermes system functions.
</p>

<p>
We measure the time application processes spend in <code>hermes-&gt;Finalize</code>, which is
essentially flushing buffers.
</p>

<div class="org-src-container">
<pre class="src src-C++">
<span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">shared_ptr</span>&lt;<span style="color: #D0372D;">hapi</span>::Hermes&gt; <span style="color: #BA36A5;">hermes</span> = <span style="color: #D0372D;">hapi</span>::InitHermes(config_file);

<span style="color: #0000FF;">if</span> (hermes-&gt;IsApplicationCore())
  {
    hermes_app_main(&amp;argc, &amp;argv, hermes);

    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">app_size</span> = hermes-&gt;GetNumProcesses();
    <span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">start</span> = <span style="color: #D0372D;">high_resolution_clock</span>::now();

    hermes-&gt;Finalize();

    <span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">elapsed</span> = <span style="color: #D0372D;">high_resolution_clock</span>::now() - start;
    <span style="color: #6434A3;">uint64_t</span> <span style="color: #BA36A5;">us</span> = duration_cast&lt;microseconds&gt;(elapsed).count();

    <span style="color: #D0372D;">std</span>::cout &lt;&lt; <span style="color: #008000;">"hermes-&gt;Finalize [us] : "</span> &lt;&lt; us &lt;&lt; <span style="color: #008000;">" : ~"</span>
              &lt;&lt; (<span style="color: #6434A3;">size_t</span>) (atol(argv[1])*atol(argv[2])*1024*1024 /
                           (app_size * us)) &lt;&lt; <span style="color: #008000;">" MB/s\n"</span>;
  }
<span style="color: #0000FF;">else</span>
  hermes-&gt;Finalize();

</pre>
</div>

<div class="org-src-container">
<pre class="src src-C++">
    MPI_Finalize();
  }
<span style="color: #0000FF;">catch</span> (<span style="color: #0000FF;">const</span> <span style="color: #D0372D;">std</span>::<span style="color: #6434A3;">exception</span>&amp; <span style="color: #BA36A5;">e</span>)
  {
    <span style="color: #D0372D;">std</span>::cout &lt;&lt; <span style="color: #008000;">" a standard exception was caught, with message '"</span>
              &lt;&lt; e.what() &lt;&lt; <span style="color: #008000;">"'\n"</span>;
  }

<span style="color: #0000FF;">return</span> 0;

</pre>
</div>
</div>
</div>
