hermes-demo/hermes-demo.org
** Do it

#+begin_example

demo1 <blob_count> <blob_size_mib> <placement_strategy> <hermes_config>

#+end_example

_Placement strategies_:

- 0 :: Random placement
- 1 :: Round-robin
- 2 :: Linear programming

#+begin_src sh

mpiexec -n 4 demo1 32 4 0 ./hermes.conf 2>&1 | tee stdout.xt | grep "\[us\]"

#+end_src

** Sample results

#+begin_example
hermes@d69a3f7ab649:~$ mpiexec -n 4 ./source/build/bin/demo1 32 4 0 \
                         ./hermes.conf 2>&1 | tee stdout.xt | grep "\[us\]"
Bucket->Put [us] : 109585 : ~408 MB/s
Bucket->Put [us] : 283296 : ~157 MB/s
Bucket->Put [us] : 295500 : ~151 MB/s
Bucket->Get [us] : 14239 : ~3142 MB/s
Bucket->Get [us] : 16460 : ~2718 MB/s
Bucket->Get [us] : 17578 : ~2545 MB/s
hermes->Finalize [us] : 8281338 : ~5 MB/s
hermes->Finalize [us] : 8284611 : ~5 MB/s
hermes->Finalize [us] : 8282374 : ~5 MB/s

hermes@d69a3f7ab649:~$ mpiexec -n 4 ./source/build/bin/demo1 32 4 1 \
                         ./hermes.conf 2>&1 | tee stdout.xt | grep "\[us\]"
Bucket->Put [us] : 111854 : ~399 MB/s
Bucket->Put [us] : 238306 : ~187 MB/s
Bucket->Put [us] : 276623 : ~161 MB/s
Bucket->Get [us] : 13842 : ~3232 MB/s
Bucket->Get [us] : 14838 : ~3015 MB/s
Bucket->Get [us] : 15763 : ~2838 MB/s
hermes->Finalize [us] : 7954699 : ~5 MB/s
hermes->Finalize [us] : 7955607 : ~5 MB/s
hermes->Finalize [us] : 7956513 : ~5 MB/s

hermes@d69a3f7ab649:~$ mpiexec -n 4 ./source/build/bin/demo1 32 4 2 \
                         ./hermes.conf 2>&1 | tee stdout.xt | grep "\[us\]"
Bucket->Put [us] : 115891 : ~386 MB/s
Bucket->Put [us] : 253087 : ~176 MB/s
Bucket->Put [us] : 256169 : ~174 MB/s
Bucket->Get [us] : 13544 : ~3303 MB/s
Bucket->Get [us] : 14853 : ~3012 MB/s
Bucket->Get [us] : 15710 : ~2847 MB/s
hermes->Finalize [us] : 23256456 : ~1 MB/s
hermes->Finalize [us] : 23257266 : ~1 MB/s
hermes->Finalize [us] : 23258535 : ~1 MB/s

#+end_example

* Demo 2 - The UNIX STDIO Adapter

** Goal

Demonstrate the use of the UNIX STDIO adapter by intercepting =fopen=, =fwrite=, and =fclose=.

** Code

Create a file w/ ~fopen~ and write a few bytes w/ ~fwrite~. Hermes intercepts
the calls and ensures the right things are happening.

#+begin_src C++ -N :tangle demo2.cc

#include <cassert>
#include <chrono>
#include <cstdio>
#include <cstdlib>
#include <iostream>

#include "mpi.h"

using namespace std::chrono;

int main(int argc, char** argv)
{
  // HACK: This is an artifact of how we are currently deploying Hermes.
  MPI_Init(&argc, &argv);

  FILE* fp;
  assert((fp = fopen("foo.bytes", "w+")) != NULL);

  size_t size = 4096;
  if (argc == 2)
    size = (size_t) atol(argv[1]);

  unsigned char* buf = (unsigned char*) malloc(size);
  assert(buf != NULL);

  auto start = high_resolution_clock::now();

  assert(fwrite(buf, sizeof(unsigned char), size, fp) == size);

  auto elapsed = high_resolution_clock::now() - start;
  uint64_t us1 = duration_cast<microseconds>(elapsed).count();

  assert(fclose(fp) == 0);
  elapsed = high_resolution_clock::now() - start;
  uint64_t us2 = duration_cast<microseconds>(elapsed).count();

  std::cout << "fwrite [us] : " << us1 << " : ~" << size / us1 << " MB/s\n";
  std::cout << "fwrite+fclose [us] : " << us2 << " : ~" << size / us2
            << " MB/s\n";

  free(buf);

  // HACK: Again...
  MPI_Finalize();

  return 0;
}

#+end_src

Run it!

#+begin_src sh

LD_PRELOAD=libhermes_stdio.so demo2 $((2048*1024*1024)) > stdout.txt 2>&1

#+end_src

** Sample results

#+begin_example

hermes@991d97cb00f1:~/source/build$ LD_PRELAOD=libhermes_stdio.so ./bin/demo2 \
  $((2048*1024*1024)) 2>&1 | tee stdout.txt | grep "\[us\]"
fwrite [us] : 405653 : ~5293 MB/s
fwrite+fclose [us] : 1570303 : ~1367 MB/s

#+end_example


* Appendix

