hermes-demo/index.html

<div id="outline-container-org0a14512" class="outline-3">
<h3 id="org0a14512">Do it</h3>
<div class="outline-text-3" id="text-org0a14512">
<pre class="example" id="org06e8765">

demo1 &lt;blob_count&gt; &lt;blob_size_mib&gt; &lt;placement_strategy&gt; &lt;hermes_config&gt;

</pre>

<p>
<span class="underline">Placement strategies</span>:
</p>

<dl class="org-dl">
<dt>0</dt><dd>Random placement</dd>
<dt>1</dt><dd>Round-robin</dd>
<dt>2</dt><dd>Linear programming</dd>
</dl>

<div class="org-src-container">
<pre class="src src-sh">
mpiexec -n 4 demo1 32 4 0 ./hermes.conf 2&gt;&amp;1 | tee stdout.xt | grep <span style="color: #008000;">"\[us\]"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4c5984" class="outline-3">
<h3 id="orgb4c5984">Sample results</h3>
<div class="outline-text-3" id="text-orgb4c5984">
<pre class="example" id="orgcdd9d61">
hermes@d69a3f7ab649:~$ mpiexec -n 4 ./source/build/bin/demo1 32 4 0 \
                         ./hermes.conf 2&gt;&amp;1 | tee stdout.xt | grep "\[us\]"
Bucket-&gt;Put [us] : 109585 : ~408 MB/s
Bucket-&gt;Put [us] : 283296 : ~157 MB/s
Bucket-&gt;Put [us] : 295500 : ~151 MB/s
Bucket-&gt;Get [us] : 14239 : ~3142 MB/s
Bucket-&gt;Get [us] : 16460 : ~2718 MB/s
Bucket-&gt;Get [us] : 17578 : ~2545 MB/s
hermes-&gt;Finalize [us] : 8281338 : ~5 MB/s
hermes-&gt;Finalize [us] : 8284611 : ~5 MB/s
hermes-&gt;Finalize [us] : 8282374 : ~5 MB/s

hermes@d69a3f7ab649:~$ mpiexec -n 4 ./source/build/bin/demo1 32 4 1 \
                         ./hermes.conf 2&gt;&amp;1 | tee stdout.xt | grep "\[us\]"
Bucket-&gt;Put [us] : 111854 : ~399 MB/s
Bucket-&gt;Put [us] : 238306 : ~187 MB/s
Bucket-&gt;Put [us] : 276623 : ~161 MB/s
Bucket-&gt;Get [us] : 13842 : ~3232 MB/s
Bucket-&gt;Get [us] : 14838 : ~3015 MB/s
Bucket-&gt;Get [us] : 15763 : ~2838 MB/s
hermes-&gt;Finalize [us] : 7954699 : ~5 MB/s
hermes-&gt;Finalize [us] : 7955607 : ~5 MB/s
hermes-&gt;Finalize [us] : 7956513 : ~5 MB/s

hermes@d69a3f7ab649:~$ mpiexec -n 4 ./source/build/bin/demo1 32 4 2 \
                         ./hermes.conf 2&gt;&amp;1 | tee stdout.xt | grep "\[us\]"
Bucket-&gt;Put [us] : 115891 : ~386 MB/s
Bucket-&gt;Put [us] : 253087 : ~176 MB/s
Bucket-&gt;Put [us] : 256169 : ~174 MB/s
Bucket-&gt;Get [us] : 13544 : ~3303 MB/s
Bucket-&gt;Get [us] : 14853 : ~3012 MB/s
Bucket-&gt;Get [us] : 15710 : ~2847 MB/s
hermes-&gt;Finalize [us] : 23256456 : ~1 MB/s
hermes-&gt;Finalize [us] : 23257266 : ~1 MB/s
hermes-&gt;Finalize [us] : 23258535 : ~1 MB/s

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd6dabb6" class="outline-2">
<h2 id="orgd6dabb6">Demo 2 - The UNIX STDIO Adapter</h2>
<div class="outline-text-2" id="text-orgd6dabb6">
</div>
<div id="outline-container-org5075c1c" class="outline-3">
<h3 id="org5075c1c">Goal</h3>
<div class="outline-text-3" id="text-org5075c1c">
<p>
Demonstrate the use of the UNIX STDIO adapter by intercepting <code>fopen</code>, <code>fwrite</code>, and <code>fclose</code>.
</p>
</div>
</div>

<div id="outline-container-org8b5abbe" class="outline-3">
<h3 id="org8b5abbe">Code</h3>
<div class="outline-text-3" id="text-org8b5abbe">
<p>
Create a file w/ <code>fopen</code> and write a few bytes w/ <code>fwrite</code>. Hermes intercepts
the calls and ensures the right things are happening.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span class="linenr"> 1: </span>
<span class="linenr"> 2: </span><span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;cassert&gt;</span>
<span class="linenr"> 3: </span><span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;chrono&gt;</span>
<span class="linenr"> 4: </span><span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;cstdio&gt;</span>
<span class="linenr"> 5: </span><span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;cstdlib&gt;</span>
<span class="linenr"> 6: </span><span style="color: #808080;">#include</span> <span style="color: #008000;">&lt;iostream&gt;</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #808080;">#include</span> <span style="color: #008000;">"mpi.h"</span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #0000FF;">using</span> <span style="color: #0000FF;">namespace</span> <span style="color: #D0372D;">std</span>::<span style="color: #D0372D;">chrono</span>;
<span class="linenr">11: </span>
<span class="linenr">12: </span><span style="color: #6434A3;">int</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">argc</span>, <span style="color: #6434A3;">char</span>** <span style="color: #BA36A5;">argv</span>)
<span class="linenr">13: </span>{
<span class="linenr">14: </span>  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">HACK: This is an artifact of how we are currently deploying Hermes.</span>
<span class="linenr">15: </span>  MPI_Init(&amp;argc, &amp;argv);
<span class="linenr">16: </span>
<span class="linenr">17: </span>  <span style="color: #6434A3;">FILE</span>* <span style="color: #BA36A5;">fp</span>;
<span class="linenr">18: </span>  assert((fp = fopen(<span style="color: #008000;">"foo.bytes"</span>, <span style="color: #008000;">"w+"</span>)) != <span style="color: #D0372D;">NULL</span>);
<span class="linenr">19: </span>
<span class="linenr">20: </span>  <span style="color: #6434A3;">size_t</span> <span style="color: #BA36A5;">size</span> = 4096;
<span class="linenr">21: </span>  <span style="color: #0000FF;">if</span> (argc == 2)
<span class="linenr">22: </span>    size = (<span style="color: #6434A3;">size_t</span>) atol(argv[1]);
<span class="linenr">23: </span>
<span class="linenr">24: </span>  <span style="color: #6434A3;">unsigned</span> <span style="color: #6434A3;">char</span>* <span style="color: #BA36A5;">buf</span> = (<span style="color: #6434A3;">unsigned</span> <span style="color: #6434A3;">char</span>*) malloc(size);
<span class="linenr">25: </span>  assert(buf != <span style="color: #D0372D;">NULL</span>);
<span class="linenr">26: </span>
<span class="linenr">27: </span>  <span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">start</span> = <span style="color: #D0372D;">high_resolution_clock</span>::now();
<span class="linenr">28: </span>
<span class="linenr">29: </span>  assert(fwrite(buf, <span style="color: #0000FF;">sizeof</span>(<span style="color: #6434A3;">unsigned</span> <span style="color: #6434A3;">char</span>), size, fp) == size);
<span class="linenr">30: </span>
<span class="linenr">31: </span>  <span style="color: #0000FF;">auto</span> <span style="color: #BA36A5;">elapsed</span> = <span style="color: #D0372D;">high_resolution_clock</span>::now() - start;
<span class="linenr">32: </span>  <span style="color: #6434A3;">uint64_t</span> <span style="color: #BA36A5;">us1</span> = duration_cast&lt;microseconds&gt;(elapsed).count();
<span class="linenr">33: </span>
<span class="linenr">34: </span>  assert(fclose(fp) == 0);
<span class="linenr">35: </span>  elapsed = <span style="color: #D0372D;">high_resolution_clock</span>::now() - start;
<span class="linenr">36: </span>  <span style="color: #6434A3;">uint64_t</span> <span style="color: #BA36A5;">us2</span> = duration_cast&lt;microseconds&gt;(elapsed).count();
<span class="linenr">37: </span>
<span class="linenr">38: </span>  <span style="color: #D0372D;">std</span>::cout &lt;&lt; <span style="color: #008000;">"fwrite [us] : "</span> &lt;&lt; us1 &lt;&lt; <span style="color: #008000;">" : ~"</span> &lt;&lt; size / us1 &lt;&lt; <span style="color: #008000;">" MB/s\n"</span>;
<span class="linenr">39: </span>  <span style="color: #D0372D;">std</span>::cout &lt;&lt; <span style="color: #008000;">"fwrite+fclose [us] : "</span> &lt;&lt; us2 &lt;&lt; <span style="color: #008000;">" : ~"</span> &lt;&lt; size / us2
<span class="linenr">40: </span>            &lt;&lt; <span style="color: #008000;">" MB/s\n"</span>;
<span class="linenr">41: </span>
<span class="linenr">42: </span>  free(buf);
<span class="linenr">43: </span>
<span class="linenr">44: </span>  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">HACK: Again...</span>
<span class="linenr">45: </span>  MPI_Finalize();
<span class="linenr">46: </span>
<span class="linenr">47: </span>  <span style="color: #0000FF;">return</span> 0;
<span class="linenr">48: </span>}
<span class="linenr">49: </span>
</pre>
</div>

<p>
Run it!
</p>

<div class="org-src-container">
<pre class="src src-sh">
<span style="color: #BA36A5;">LD_PRELOAD</span>=libhermes_stdio.so demo2 $((2048*1024*1024)) &gt; stdout.txt 2&gt;&amp;1

</pre>
</div>
</div>
</div>

<div id="outline-container-org2a733df" class="outline-3">
<h3 id="org2a733df">Sample results</h3>
<div class="outline-text-3" id="text-org2a733df">
<pre class="example" id="org7480a3e">

hermes@991d97cb00f1:~/source/build$ LD_PRELAOD=libhermes_stdio.so ./bin/demo2 \
  $((2048*1024*1024)) 2&gt;&amp;1 | tee stdout.txt | grep "\[us\]"
fwrite [us] : 405653 : ~5293 MB/s
fwrite+fclose [us] : 1570303 : ~1367 MB/s

</pre>
</div>
</div>
</div>
